[
  {
    "task_description": "Create a dspy advanced skill: Advanced DSPy modules including ReAct agents, tool calling, output refinement (BestOfN, Refine), and adapters. Use when building agent systems, integrating external tools, or implementing multi-step reasoning.",
    "expected_taxonomy_path": "dspy/dspy-advanced",
    "expected_name": "dspy-advanced",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "dspy",
      "advanced"
    ],
    "expected_description": "Advanced DSPy modules including ReAct agents, tool calling, output refinement (BestOfN, Refine), and adapters. Use when building agent systems, integrating external tools, or implementing multi-step r",
    "source": "golden_example"
  },
  {
    "task_description": "Create a dspy basics skill: Core DSPy fundamentals for signature design, basic modules (Predict, ChainOfThought), and program composition patterns. Use when creating new signatures, building simple DSPy programs, or learning foundational DSPy concepts.",
    "expected_taxonomy_path": "dspy/dspy-basics",
    "expected_name": "dspy-basics",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "dspy",
      "basics"
    ],
    "expected_description": "Core DSPy fundamentals for signature design, basic modules (Predict, ChainOfThought), and program composition patterns. Use when creating new signatures, building simple DSPy programs, or learning fou",
    "source": "golden_example"
  },
  {
    "task_description": "Create a dspy configuration skill: DSPy configuration, LM setup, caching, and version management. Use when configuring language models, enabling caching, managing dependencies, or setting up multi-provider configurations.",
    "expected_taxonomy_path": "dspy/dspy-configuration",
    "expected_name": "dspy-configuration",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "dspy",
      "configuration"
    ],
    "expected_description": "DSPy configuration, LM setup, caching, and version management. Use when configuring language models, enabling caching, managing dependencies, or setting up multi-provider configurations.",
    "source": "golden_example"
  },
  {
    "task_description": "Create a dspy development skill: Provides comprehensive guidance for DSPy framework development including signature design, program construction, optimization workflows, and best practices. Use when working with DSPy modules, creating new signatures, optimizing teleprompters, or debugging DSPy code .",
    "expected_taxonomy_path": "dspy/dspy-development",
    "expected_name": "dspy-development",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "dspy",
      "development"
    ],
    "expected_description": "Provides comprehensive guidance for DSPy framework development including signature design, program construction, optimization workflows, and best practices. Use when working with DSPy modules, creatin",
    "source": "golden_example"
  },
  {
    "task_description": "Create a dspy optimization skill: DSPy optimizers (teleprompters), evaluation metrics, and optimization workflows. Use when compiling programs with BootstrapFewShot, KNNFewShot, MIPROv2, GEPA, or defining custom metrics.",
    "expected_taxonomy_path": "dspy/dspy-optimization",
    "expected_name": "dspy-optimization",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "dspy",
      "optimization"
    ],
    "expected_description": "DSPy optimizers (teleprompters), evaluation metrics, and optimization workflows. Use when compiling programs with BootstrapFewShot, KNNFewShot, MIPROv2, GEPA, or defining custom metrics.",
    "source": "golden_example"
  },
  {
    "task_description": "Create a FastAPI Stack Development skill: Comprehensive guidance for FastAPI, Typer, and SQLModel development including patterns, best practices, API design, CLI development, database integration, testing, and common workflows. Use this skill when building applications with any of these frameworks.",
    "expected_taxonomy_path": "general/FastAPI Stack Development",
    "expected_name": "FastAPI Stack Development",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "FastAPI Stack Development"
    ],
    "expected_description": "Comprehensive guidance for FastAPI, Typer, and SQLModel development including patterns, best practices, API design, CLI development, database integration, testing, and common workflows. Use this skill",
    "source": "golden_example"
  },
  {
    "task_description": "Create a frontend ui integration skill: Implement or extend a user-facing workflow in a web application, integrating with existing backend APIs. Use when the feature is primarily a UI/UX change backed by existing APIs, affects only the web frontend, and requires following design system, routing, and testing conventions.",
    "expected_taxonomy_path": "frontend/frontend-ui-integration",
    "expected_name": "frontend-ui-integration",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "frontend",
      "ui",
      "integration"
    ],
    "expected_description": "Implement or extend a user-facing workflow in a web application, integrating with existing backend APIs. Use when the feature is primarily a UI/UX change backed by existing APIs, affects only the web ",
    "source": "golden_example"
  },
  {
    "task_description": "Create a add neon docs skill: Use this skill when the user asks to add documentation, add docs, add references, or install documentation about Neon. Adds Neon best practices reference links to project AI documentation (CLAUDE.md, AGENTS.md, or Cursor rules). Does not install packages or modify code.",
    "expected_taxonomy_path": "add/add-neon-docs",
    "expected_name": "add-neon-docs",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "add",
      "neon",
      "docs"
    ],
    "expected_description": "Use this skill when the user asks to add documentation, add docs, add references, or install documentation about Neon. Adds Neon best practices reference links to project AI documentation (CLAUDE.md, ",
    "source": "golden_example"
  },
  {
    "task_description": "Create a neon auth skill: Sets up Neon Auth for your application. Configures authentication, creates auth routes, and generates UI components. Use when adding authentication to Next.js, React SPA, or Node.js projects.",
    "expected_taxonomy_path": "neon/neon-auth",
    "expected_name": "neon-auth",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "neon",
      "auth"
    ],
    "expected_description": "Sets up Neon Auth for your application. Configures authentication, creates auth routes, and generates UI components. Use when adding authentication to Next.js, React SPA, or Node.js projects.",
    "source": "golden_example"
  },
  {
    "task_description": "Create a neon drizzle skill: Creates a fully functional Drizzle ORM setup with a provisioned Neon database. Installs dependencies, provisions database credentials, configures connections, generates schemas, and runs migrations. Results in working code that can immediately connect to and query the database. Use when creating new projects with Drizzle, adding ORM to existing applications, or modifying database schemas.",
    "expected_taxonomy_path": "neon/neon-drizzle",
    "expected_name": "neon-drizzle",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references",
      "guides"
    ],
    "expected_keywords": [
      "neon",
      "drizzle"
    ],
    "expected_description": "Creates a fully functional Drizzle ORM setup with a provisioned Neon database. Installs dependencies, provisions database credentials, configures connections, generates schemas, and runs migrations. R",
    "source": "golden_example"
  },
  {
    "task_description": "Create a neon js skill: Sets up the full Neon JS SDK with unified auth and PostgREST-style database queries. Configures auth client, data client, and type generation. Use when building apps that need both authentication and database access in one SDK.",
    "expected_taxonomy_path": "neon/neon-js",
    "expected_name": "neon-js",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "neon",
      "js"
    ],
    "expected_description": "Sets up the full Neon JS SDK with unified auth and PostgREST-style database queries. Configures auth client, data client, and type generation. Use when building apps that need both authentication and ",
    "source": "golden_example"
  },
  {
    "task_description": "Create a neon serverless skill: Configures Neon Serverless Driver for Next.js, Vercel Edge Functions, AWS Lambda, and other serverless environments. Installs @neondatabase/serverless, sets up environment variables, and creates working API route examples with TypeScript types. Use when users need to connect their application to Neon, fetch or query data from a Neon database, integrate Neon with Next.js or serverless frameworks, or set up database access in edge/serverless environments where traditional PostgreSQL clients don't work.",
    "expected_taxonomy_path": "neon/neon-serverless",
    "expected_name": "neon-serverless",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [],
    "expected_keywords": [
      "neon",
      "serverless"
    ],
    "expected_description": "Configures Neon Serverless Driver for Next.js, Vercel Edge Functions, AWS Lambda, and other serverless environments. Installs @neondatabase/serverless, sets up environment variables, and creates worki",
    "source": "golden_example"
  },
  {
    "task_description": "Create a neon toolkit skill: Creates and manages ephemeral Neon databases for testing, CI/CD pipelines, and isolated development environments. Use when building temporary databases for automated tests or rapid prototyping.",
    "expected_taxonomy_path": "neon/neon-toolkit",
    "expected_name": "neon-toolkit",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [],
    "expected_keywords": [
      "neon",
      "toolkit"
    ],
    "expected_description": "Creates and manages ephemeral Neon databases for testing, CI/CD pipelines, and isolated development environments. Use when building temporary databases for automated tests or rapid prototyping.",
    "source": "golden_example"
  },
  {
    "task_description": "Create a product management skill: Assist with core product management activities including writing PRDs, analyzing features, synthesizing user research, planning roadmaps, and communicating product decisions. Use when you need help with PM documentation, analysis, or planning workflows that integrate with your codebase.",
    "expected_taxonomy_path": "product/product-management",
    "expected_name": "product-management",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "product",
      "management"
    ],
    "expected_description": "Assist with core product management activities including writing PRDs, analyzing features, synthesizing user research, planning roadmaps, and communicating product decisions. Use when you need help wi",
    "source": "golden_example"
  },
  {
    "task_description": "Create a vibe coding skill: Rapidly prototype and build modern, responsive web applications from scratch using current frameworks and libraries. Use when you want to quickly create a new web app with full local control, creative flow, and modern best practices. Local alternative to Lovable, Bolt, and v0.",
    "expected_taxonomy_path": "vibe/vibe-coding",
    "expected_name": "vibe-coding",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "vibe",
      "coding"
    ],
    "expected_description": "Rapidly prototype and build modern, responsive web applications from scratch using current frameworks and libraries. Use when you want to quickly create a new web app with full local control, creative",
    "source": "golden_example"
  },
  {
    "task_description": "Create a prompt-refiner-claude skill: Refine prompts for Claude models (Opus, Sonnet, Haiku) using Anthropic's best practices. Use when preparing complex tasks for Claude.",
    "expected_taxonomy_path": "prompt-refiner-claude",
    "expected_name": "prompt-refiner-claude",
    "expected_skill_style": "minimal",
    "expected_subdirectories": [],
    "expected_keywords": [
      "prompt",
      "refiner",
      "claude"
    ],
    "expected_description": "Refine prompts for Claude models (Opus, Sonnet, Haiku) using Anthropic's best practices. Use when preparing complex tasks for Claude.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a astral-ty-integration skill: Standardized workflow for integrating Astral's 'ty' type checker into existing Python projects, focusing on incremental adoption and high-performance CI/CD pipelines.",
    "expected_taxonomy_path": "_drafts/26f10af6-4566-4ac3-90a2-33cbf5174c4b/technical_skills/python/type_checking/astral-ty-integration",
    "expected_name": "astral-ty-integration",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples"
    ],
    "expected_keywords": [
      "astral",
      "integration",
      "python"
    ],
    "expected_description": "Standardized workflow for integrating Astral's 'ty' type checker into existing Python projects, focusing on incremental adoption and high-performance CI/CD pipelines.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a tavily-rest-api-tool skill: A Python implementation of a REST API wrapper for the Tavily Search service, designed to provide structured web search capabilities to AI agents.",
    "expected_taxonomy_path": "_drafts/51a31ca6-3c08-47eb-b2de-d0b5bf962271/tools/web_search/tavily",
    "expected_name": "tavily-rest-api-tool",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "scripts",
      "examples"
    ],
    "expected_keywords": [
      "tavily",
      "rest",
      "api",
      "tool",
      "api",
      "python"
    ],
    "expected_description": "A Python implementation of a REST API wrapper for the Tavily Search service, designed to provide structured web search capabilities to AI agents.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a ephemeral-memory-protocol skill: A markdown-based protocol for managing temporary, session-specific information. to prevent context clutter in local AI interactions.",
    "expected_taxonomy_path": "_drafts/54dbf8d8-887a-43da-9eba-f4fb0819282d/memory_blocks/ephemeral-memory-protocol",
    "expected_name": "ephemeral-memory-protocol",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "scripts",
      "examples"
    ],
    "expected_keywords": [
      "ephemeral",
      "memory",
      "protocol"
    ],
    "expected_description": "A markdown-based protocol for managing temporary, session-specific information. to prevent context clutter in local AI interactions.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a python-advanced-typing-utility-types skill: Advanced technical reference for Python static typing, covering Protocols, Generics, Type Narrowing, and complex utility types for production-grade software.",
    "expected_taxonomy_path": "_drafts/a7d042f0-4234-4e8b-9083-6f6951317080/technical_skills/programming/python/typing/python-advanced-typing-utility-types",
    "expected_name": "python-advanced-typing-utility-types",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples"
    ],
    "expected_keywords": [
      "python",
      "advanced",
      "typing",
      "utility",
      "types",
      "python"
    ],
    "expected_description": "Advanced technical reference for Python static typing, covering Protocols, Generics, Type Narrowing, and complex utility types for production-grade software.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a fastapi-pytest-workflow skill: Standardized workflow and fixtures for isolated unit testing in FastAPI, including SQLAlchemy session mocking and pyfakefs integration.",
    "expected_taxonomy_path": "_drafts/be481007-7f46-4678-a959-f22cfb6468ce/technical_skills/python/testing/pytest/fastapi",
    "expected_name": "fastapi-pytest-workflow",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "scripts",
      "examples"
    ],
    "expected_keywords": [
      "fastapi",
      "pytest",
      "workflow",
      "fastapi",
      "testing"
    ],
    "expected_description": "Standardized workflow and fixtures for isolated unit testing in FastAPI, including SQLAlchemy session mocking and pyfakefs integration.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a react-vite-production-setup skill: A comprehensive workflow for initializing and configuring a production-ready React SPA using Vite, TypeScript, Tailwind CSS, and TanStack Query with a feature-based architecture.",
    "expected_taxonomy_path": "_drafts/e6f8da04-794a-40d4-963f-f69a4aecb867/technical_skills/web_development/frontend/react/react-vite-production-setup",
    "expected_name": "react-vite-production-setup",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "scripts",
      "examples"
    ],
    "expected_keywords": [
      "react",
      "vite",
      "production",
      "setup",
      "react",
      "typescript"
    ],
    "expected_description": "A comprehensive workflow for initializing and configuring a production-ready React SPA using Vite, TypeScript, Tailwind CSS, and TanStack Query with a feature-based architecture.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a shadcn-custom-registry skill: Architect and distribute an organizational design system using the shadcn/uiregistry pattern, allowing teams to install custom components via the shadcn CLI.",
    "expected_taxonomy_path": "_drafts/f1d7b1a8-b4fd-4ecf-bf01-de283f470d5f/software_development/frontend/design_systems/shadcn-custom-registry",
    "expected_name": "shadcn-custom-registry",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "scripts",
      "examples"
    ],
    "expected_keywords": [
      "shadcn",
      "custom",
      "registry",
      "cli"
    ],
    "expected_description": "Architect and distribute an organizational design system using the shadcn/uiregistry pattern, allowing teams to install custom components via the shadcn CLI.",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a fastapi-production-patterns skill: Use when building FastAPI apps with async database operations, complex dependency injection, partial update endpoints, async testing, or converting Python utilities to API endpoints",
    "expected_taxonomy_path": "python/fastapi-production",
    "expected_name": "fastapi-production-patterns",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples"
    ],
    "expected_keywords": [
      "fastapi",
      "production",
      "patterns",
      "api",
      "async",
      "database",
      "fastapi"
    ],
    "expected_description": "Use when building FastAPI apps with async database operations, complex dependency injection, partial update endpoints, async testing, or converting Python utilities to API endpoints",
    "source": "extracted_from_existing"
  },
  {
    "task_description": "Create a python async patterns skill: Master asynchronous programming in Python with async/await, event loops, and concurrent execution patterns. Use when building async APIs, handling concurrent I/O, or optimizing performance with asyncio.",
    "expected_taxonomy_path": "python/async-patterns",
    "expected_name": "async-patterns",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "guides"
    ],
    "expected_keywords": [
      "python",
      "async",
      "await",
      "asyncio",
      "concurrent"
    ],
    "expected_description": "Master asynchronous programming in Python with async/await, event loops, and concurrent execution patterns. Use when building async APIs or handling concurrent I/O operations.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a python error handling skill: Implement robust error handling with try/except blocks, custom exceptions, and error recovery strategies. Use when building production Python applications requiring reliability and graceful degradation.",
    "expected_taxonomy_path": "python/error-handling",
    "expected_name": "error-handling",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "python",
      "error",
      "exception",
      "try",
      "except"
    ],
    "expected_description": "Implement robust error handling with try/except blocks, custom exceptions, and error recovery strategies for production applications.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a python dataclasses skill: Use Python dataclasses for clean data modeling with automatic __init__, __repr__, and comparison methods. Use when defining data structures, DTOs, or configuration objects.",
    "expected_taxonomy_path": "python/dataclasses",
    "expected_name": "dataclasses",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [],
    "expected_keywords": [
      "python",
      "dataclass",
      "model",
      "dto"
    ],
    "expected_description": "Use Python dataclasses for clean data modeling with automatic methods. Use when defining data structures or configuration objects.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a python logging best practices skill: Configure Python logging with handlers, formatters, and log levels for production applications. Use when implementing structured logging, log aggregation, or debugging workflows.",
    "expected_taxonomy_path": "python/logging",
    "expected_name": "logging",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides",
      "templates"
    ],
    "expected_keywords": [
      "python",
      "logging",
      "debug",
      "monitor"
    ],
    "expected_description": "Configure Python logging with handlers, formatters, and log levels for production. Use for structured logging or debugging workflows.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a testing pytest fixtures skill: Master pytest fixtures for test setup, teardown, and dependency injection. Use when writing maintainable tests with reusable test components and complex test scenarios.",
    "expected_taxonomy_path": "testing/pytest-fixtures",
    "expected_name": "pytest-fixtures",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "examples"
    ],
    "expected_keywords": [
      "pytest",
      "fixtures",
      "testing",
      "setup"
    ],
    "expected_description": "Master pytest fixtures for test setup, teardown, and dependency injection. Use for maintainable tests with reusable components.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a testing mocking strategies skill: Implement effective test mocking with unittest.mock, pytest-mock, and dependency injection. Use when isolating units under test, mocking external services, or testing edge cases.",
    "expected_taxonomy_path": "testing/mocking",
    "expected_name": "mocking",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "testing",
      "mock",
      "unittest",
      "pytest"
    ],
    "expected_description": "Implement effective test mocking with unittest.mock and pytest-mock. Use when isolating units under test or mocking external services.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a web react hooks patterns skill: Master React hooks (useState, useEffect, useContext, custom hooks) for functional components. Use when building modern React applications with state management and side effects.",
    "expected_taxonomy_path": "web/react-hooks",
    "expected_name": "react-hooks",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "examples"
    ],
    "expected_keywords": [
      "react",
      "hooks",
      "useState",
      "useEffect"
    ],
    "expected_description": "Master React hooks for functional components. Use when building modern React applications with state management and side effects.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a web api design patterns skill: Design RESTful APIs with proper resource modeling, HTTP methods, status codes, and versioning strategies. Use when architecting backend APIs or defining API contracts.",
    "expected_taxonomy_path": "web/api-design",
    "expected_name": "api-design",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references",
      "guides",
      "examples"
    ],
    "expected_keywords": [
      "api",
      "rest",
      "http",
      "design"
    ],
    "expected_description": "Design RESTful APIs with proper resource modeling, HTTP methods, and status codes. Use when architecting backend APIs.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a web authentication jwt skill: Implement JWT-based authentication with token generation, validation, and refresh strategies. Use when adding authentication to web APIs or SPAs.",
    "expected_taxonomy_path": "web/auth-jwt",
    "expected_name": "auth-jwt",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides",
      "templates"
    ],
    "expected_keywords": [
      "auth",
      "jwt",
      "token",
      "security"
    ],
    "expected_description": "Implement JWT-based authentication with token generation and validation. Use when adding authentication to web APIs or SPAs.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a devops docker compose skill: Orchestrate multi-container applications with Docker Compose including service dependencies, networking, and volumes. Use when setting up development environments or deploying multi-service applications.",
    "expected_taxonomy_path": "devops/docker-compose",
    "expected_name": "docker-compose",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples",
      "templates"
    ],
    "expected_keywords": [
      "docker",
      "compose",
      "container",
      "devops"
    ],
    "expected_description": "Orchestrate multi-container applications with Docker Compose. Use when setting up development environments or deploying applications.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a devops github actions skill: Automate CI/CD workflows with GitHub Actions including testing, building, and deployment pipelines. Use when implementing continuous integration or automated deployments.",
    "expected_taxonomy_path": "devops/github-actions",
    "expected_name": "github-actions",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples",
      "templates"
    ],
    "expected_keywords": [
      "github",
      "actions",
      "ci",
      "cd",
      "automation"
    ],
    "expected_description": "Automate CI/CD workflows with GitHub Actions. Use when implementing continuous integration or automated deployments.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a devops environment variables skill: Manage environment-specific configuration with .env files, environment variables, and secrets management. Use when configuring applications for different environments or handling sensitive data.",
    "expected_taxonomy_path": "devops/env-config",
    "expected_name": "env-config",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "env",
      "config",
      "secrets",
      "security"
    ],
    "expected_description": "Manage environment-specific configuration with .env files and secrets. Use when configuring applications for different environments.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a database sql query optimization skill: Optimize SQL queries with indexes, query planning, and performance analysis. Use when diagnosing slow queries, improving database performance, or scaling data access.",
    "expected_taxonomy_path": "database/sql-optimization",
    "expected_name": "sql-optimization",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "guides"
    ],
    "expected_keywords": [
      "sql",
      "optimization",
      "index",
      "performance"
    ],
    "expected_description": "Optimize SQL queries with indexes and query planning. Use when diagnosing slow queries or improving database performance.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a database migrations skill: Manage database schema changes with migration tools (Alembic, Flyway, Prisma Migrate). Use when evolving database schemas, deploying schema changes, or maintaining version control of database structure.",
    "expected_taxonomy_path": "database/migrations",
    "expected_name": "migrations",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides",
      "examples"
    ],
    "expected_keywords": [
      "database",
      "migration",
      "schema",
      "alembic"
    ],
    "expected_description": "Manage database schema changes with migration tools. Use when evolving database schemas or deploying schema changes.",
    "source": "synthetic"
  },
  {
    "task_description": "Create an architecture dependency injection skill: Implement dependency injection patterns for loose coupling and testability. Use when building modular applications, improving testability, or managing object lifecycles.",
    "expected_taxonomy_path": "architecture/dependency-injection",
    "expected_name": "dependency-injection",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "examples"
    ],
    "expected_keywords": [
      "architecture",
      "di",
      "injection",
      "pattern"
    ],
    "expected_description": "Implement dependency injection patterns for loose coupling. Use when building modular applications or improving testability.",
    "source": "synthetic"
  },
  {
    "task_description": "Create an architecture event driven skill: Design event-driven architectures with message queues, event buses, and asynchronous communication. Use when building scalable distributed systems or decoupling microservices.",
    "expected_taxonomy_path": "architecture/event-driven",
    "expected_name": "event-driven",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references",
      "guides",
      "examples"
    ],
    "expected_keywords": [
      "architecture",
      "event",
      "message",
      "async"
    ],
    "expected_description": "Design event-driven architectures with message queues and event buses. Use when building scalable distributed systems.",
    "source": "synthetic"
  },
  {
    "task_description": "Create an api error responses skill: Design consistent API error responses with proper status codes, error messages, and error details. Use when building production APIs requiring clear error communication.",
    "expected_taxonomy_path": "api/error-responses",
    "expected_name": "error-responses",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "examples"
    ],
    "expected_keywords": [
      "api",
      "error",
      "response",
      "http"
    ],
    "expected_description": "Design consistent API error responses with proper status codes and messages. Use when building production APIs.",
    "source": "synthetic"
  },
  {
    "task_description": "Create an api pagination skill: Implement API pagination with cursor-based, offset-based, and page-based strategies. Use when designing APIs that return large datasets or implementing efficient data fetching.",
    "expected_taxonomy_path": "api/pagination",
    "expected_name": "pagination",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples"
    ],
    "expected_keywords": [
      "api",
      "pagination",
      "cursor",
      "offset"
    ],
    "expected_description": "Implement API pagination with cursor-based and offset-based strategies. Use when designing APIs returning large datasets.",
    "source": "synthetic"
  },
  {
    "task_description": "Create an api versioning skill: Implement API versioning strategies including URL versioning, header versioning, and content negotiation. Use when evolving APIs while maintaining backward compatibility.",
    "expected_taxonomy_path": "api/versioning",
    "expected_name": "versioning",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "api",
      "version",
      "compatibility",
      "migration"
    ],
    "expected_description": "Implement API versioning strategies including URL and header versioning. Use when evolving APIs while maintaining compatibility.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a practices code review skill: Conduct effective code reviews with checklists, best practices, and constructive feedback techniques. Use when establishing code review processes or improving code quality through peer review.",
    "expected_taxonomy_path": "practices/code-review",
    "expected_name": "code-review",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references"
    ],
    "expected_keywords": [
      "review",
      "quality",
      "feedback",
      "pr"
    ],
    "expected_description": "Conduct effective code reviews with checklists and best practices. Use when establishing review processes or improving code quality.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a practices git workflow skill: Implement Git workflows (Gitflow, trunk-based, GitHub Flow) with branching strategies and merge conventions. Use when establishing team Git practices or managing code collaboration.",
    "expected_taxonomy_path": "practices/git-workflow",
    "expected_name": "git-workflow",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides"
    ],
    "expected_keywords": [
      "git",
      "workflow",
      "branch",
      "merge"
    ],
    "expected_description": "Implement Git workflows with branching strategies. Use when establishing team Git practices or managing collaboration.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a practices documentation skill: Write effective technical documentation with clear structure, code examples, and usage guides. Use when documenting APIs, creating onboarding materials, or maintaining project documentation.",
    "expected_taxonomy_path": "practices/documentation",
    "expected_name": "documentation",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "templates"
    ],
    "expected_keywords": [
      "docs",
      "documentation",
      "readme",
      "guide"
    ],
    "expected_description": "Write effective technical documentation with structure and examples. Use when documenting APIs or creating onboarding materials.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a domain machine learning basics skill: Understand ML fundamentals including supervised learning, model training, and evaluation metrics. Use when starting ML projects, understanding model behavior, or implementing basic ML workflows.",
    "expected_taxonomy_path": "domain/ml-basics",
    "expected_name": "ml-basics",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "references",
      "examples"
    ],
    "expected_keywords": [
      "ml",
      "machine-learning",
      "model",
      "training"
    ],
    "expected_description": "Understand ML fundamentals including supervised learning and model training. Use when starting ML projects or understanding model behavior.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a domain data validation skill: Implement data validation with Pydantic, JSON Schema, and custom validators. Use when processing user input, validating API requests, or ensuring data integrity.",
    "expected_taxonomy_path": "domain/data-validation",
    "expected_name": "data-validation",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "examples"
    ],
    "expected_keywords": [
      "validation",
      "pydantic",
      "schema",
      "data"
    ],
    "expected_description": "Implement data validation with Pydantic and JSON Schema. Use when processing user input or validating API requests.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a domain observability skill: Implement observability with metrics, logging, and tracing for production systems. Use when monitoring application health, debugging production issues, or implementing SRE practices.",
    "expected_taxonomy_path": "domain/observability",
    "expected_name": "observability",
    "expected_skill_style": "navigation_hub",
    "expected_subdirectories": [
      "references",
      "guides"
    ],
    "expected_keywords": [
      "observability",
      "metrics",
      "tracing",
      "monitoring"
    ],
    "expected_description": "Implement observability with metrics, logging, and tracing. Use when monitoring application health or debugging production issues.",
    "source": "synthetic"
  },
  {
    "task_description": "Create a memory caching strategies skill: Implement caching with Redis, in-memory caches, and cache invalidation strategies. Use when optimizing performance, reducing database load, or implementing distributed caching.",
    "expected_taxonomy_path": "memory/caching",
    "expected_name": "caching",
    "expected_skill_style": "comprehensive",
    "expected_subdirectories": [
      "guides",
      "examples"
    ],
    "expected_keywords": [
      "cache",
      "redis",
      "performance",
      "optimization"
    ],
    "expected_description": "Implement caching with Redis and cache invalidation strategies. Use when optimizing performance or reducing database load.",
    "source": "synthetic"
  }
]